/*******************************************************************************
*  标题:  ME300系列单片机开发系统演示程序 - AT89S51/52片内看门狗使用范例       *
*  硬件： ME300A+,ME300B                                                       *
*  文件:  wl014.c                                                              *
*  日期:  2004-1-5                                                             *
*  版本:  1.0                                                                  *
*  作者:  伟纳电子 - Freeman                                                   *
*  邮箱:  freeman@willar.com                                                   *
*  网站： http://www.willar.com                                                *
********************************************************************************
*  描述:                                                                       *
*         AT89S51/52片内看门狗使用范例                                         *
*                                                                              *
********************************************************************************
*  跳线设置：                                                                  *
*     ME300A+    JP1 全部短接，JP2短接3-4端                                    *
*     ME300B     JP1 短接，JP2短接3-4端                                        *
*                                                                              *
*                                                                              *
********************************************************************************
* 【版权】 Copyright(C)伟纳电子 www.willar.com  All Rights Reserved            *
* 【声明】 此程序仅用于学习与参考，引用请注明版权和作者信息！                  *
*******************************************************************************/


#include <reg51.h>
#include <intrins.h>


sfr AUXR    = 0x8E;		//定义AT89S51扩展寄存器
sfr WDTRST  = 0xA6;


void clr_wdt();

main()
{
	AUXR = 0xff;		// 初始化看门狗相关寄存器
	while(1)			// 主循环
	{
		clr_wdt();		// 8191个机器周期内必须至少调用此程序一次
						// 否则看门狗会溢出
		
		// 其它子程序	
		// 	
	}
}

void clr_wdt()
{
	WDTRST = 0x1E;		// 清除看门狗指令
	WDTRST = 0xE1;		// 
}
