/*******************************************************************************
*  标题:  ME300系列单片机开发系统演示程序 -  LED流水灯                         *
;* 硬件： ME300A,ME300S,ME300A+,ME300B                                         *
*  文件:  wl001.C                                                              *
*  日期:  2004-1-5                                                             *
*  版本:  1.0                                                                  *
*  作者:  伟纳电子 - Freeman                                                   *
*  邮箱:  freeman@willar.com                                                   *
*  网站： http://www.willar.com                                                *
********************************************************************************
*  描述:                                                                       *
*         LED流水灯                                                            *
*                                                                              *
********************************************************************************
*  跳线设置：                                                                  *
*     ME300A+    JP1 全部短接，JP2短接在3-4端                                  *
*     ME300B     JP1 短接，JP2短接在3-4端                                      *
*                                                                              *
*                                                                              *
********************************************************************************
* 【版权】 Copyright(C)伟纳电子 www.willar.com  All Rights Reserved            *
* 【声明】 此程序仅用于学习与参考，引用请注明版权和作者信息！                  *
*******************************************************************************/

#include<reg51.h>
#include <intrins.h>


void delayms(unsigned char ms)	
// 延时子程序
{						
	unsigned char i;
	while(ms--)
	{
		for(i = 0; i < 120; i++);
	}
}

main()
{
	unsigned char LED;
	LED = 0xfe;
	P0 = LED;
	
	while(1)
	{
		delayms(250);			
		LED = _crol_(LED,1);		//循环右移1位，点亮下一个LED
		P0 = LED;
	}
}