;********************************************************************************
;*  标题:  ME300系列单片机开发系统演示程序 - AT89S51/52片内看门狗使用范例       *
;*  硬件： ME300A+,ME300B                                                       *
;*  文件:  wl014.asm                                                            *
;*  日期:  2004-1-5                                                             *
;*  版本:  1.0                                                                  *
;*  作者:  伟纳电子 - Freeman                                                   *
;*  邮箱:  freeman@willar.com                                                   *
;*  网站： http://www.willar.com                                                *
;********************************************************************************
;*  描述:                                                                       *
;*         AT89S51/52片内看门狗使用范例                                         *
;*                                                                              *
;********************************************************************************
;*  跳线设置：                                                                  *
;*     ME300A+    JP1 全部短接，JP2短接3-4端                                    *
;*     ME300B     JP1 短接，JP2短接3-4端                                        *                                    
;*                                                                              *
;********************************************************************************
;* 【版权】 Copyright(C)伟纳电子 www.willar.com  All Rights Reserved            *
;* 【声明】 此程序仅用于学习与参考，引用请注明版权和作者信息！                  *
;********************************************************************************

AUXR	EQU	0x8E;		; 定义AT89S51扩展寄存器
WDTRST	EQU	0xA6;

	ORG	0000H
	LJMP	MAIN
		
		
	ORG	0030H	
MAIN:
	MOV	AUXR,#0FFH	; 初始化看门狗相关寄存器
	
MAIN_LP:
	LCALL	CLR_WDT		; 8191个机器周期内必须至少调用此程序一次
				; 否则看门狗会溢出	
	
; 	其它子程序		
;	SJMP	$

	LJMP	MAIN_LP	


;===============================================================================
CLR_WDT:
	MOV	WDTRST,#01EH	; 清除看门狗指令
	MOV	WDTRST,#0E1H
	RET
	